Tekla Open API Reference for Tekla Structures 2025
AnalysisNode.Label Property
 The label of the analysis node.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisLabel Label { get; set; }
Public Property Label As AnalysisLabel
	Get
	Set
Property Value
Type: AnalysisLabel
See Also
Reference
AnalysisNode Class
Tekla.Structures.Analysis Namespace